from currencyapi import (
    three_m_price,
    six_m_price,
    twelve_m_price,
)

WELCOME_TEXT = "خوش آمدید"
START_TEXT = "start"
BUY_PREMIUM_TEXT = "🛍️ خرید پرمیوم تلگرام"
BUY_FOR_SELF_TEXT = "🙋‍♂️ خرید برای خودم"
BUY_FOR_FRIENDS_TEXT = "🙋‍♂️🙋‍♂️🙋‍♂️ خرید برای دوستان"
BUY_SUCCESS_TEXT = "✅ خرید با موفقیت انجام شد"
LOREM = "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد."
FAQ_FULL_TEXT = """❓ پرسش‌های متداول (FAQ)
🔻 1. اطلاعات کلی
1.1. تلگرام پرمیوم چیست؟
تلگرام پرمیوم یک سرویس اشتراکی است که امکانات بیشتری را نسبت به نسخه رایگان تلگرام ارائه می‌دهد. این امکانات شامل امکانات اضافی، سفارشی‌سازی بیشتر، فضای ذخیره‌سازی بزرگتر و عدم نمایش تبلیغات می‌شود.

1.2. چرا باید تلگرام پرمیوم را بخرم؟
با خرید تلگرام پرمیوم، شما می‌توانید از امکانات ویژه‌ای مانند ارسال فایل‌های بزرگتر، سرعت دانلود بالاتر، استیکرهای انحصاری، و گزینه‌های سفارشی‌سازی بیشتر بهره‌مند شوید. این امکانات تجربه کاربری شما را بهبود می‌بخشند.

🔻 2. فرآیند خرید
2.1. چگونه می‌توانم اشتراک تلگرام پرمیوم را بخرم؟
برای خرید اشتراک تلگرام پرمیوم، کافی است با بات ما ارتباط برقرار کنید و مراحل ساده‌ای را دنبال کنید. بات شما را راهنمایی می‌کند تا اشتراک خود را انتخاب و پرداخت را انجام دهید.

🔻 3. پشتیبانی مشتریان
3.1. اگر به مشکلی برخوردم چه کاری باید انجام دهم؟
در صورت بروز هرگونه مشکل، شما می‌توانید از طریق بات یا حساب پشتیبانی با تیم ما در ارتباط باشید بگیرید. تیم پشتیبانی ما به صورت ۲۴/۷ آماده کمک به شماست.

🔻 4. سوالات متداول
4.1. آیا می‌توانم اشتراک تلگرام پرمیوم را به شخص دیگری هدیه دهم؟
بله، شما می‌توانید اشتراک تلگرام پرمیوم را به عنوان هدیه به دوستان یا خانواده خود ارائه دهید. برای این کار کافی است در قسمت خرید اشتراک یوز نیم شخص مورد نظر را وارد کنید.

4.2. آیا اشتراک تلگرام پرمیوم در تمام دستگاه‌ها قابل استفاده است؟
بله، با خرید اشتراک تلگرام پرمیوم، می‌توانید از امکانات آن در تمام دستگاه‌هایی که تلگرام بر روی آن‌ها نصب شده است، استفاده کنید.

"""
FAQ_TEXT = "❓ سوالات پر تکرار"
MY_PURCHASES_TEXT = "❇️ درخواست های من"
GO_BACK_TEXT = "🔙 بازگشت"
THREE_M_SUB_TEXT = "تلگرام پرمیوم سه ماهه"
SIX_M_SUB_TEXT = "تلگرام پرمیوم شش ماهه"
TWELVE_M_SUB_TEXT = "تلگرام پرمیوم دوازده ماهه"
PENDING_APPROVAL_TEXT = "در انتظار تایید"
REVIEWING_TEXT = "در حال بررسی"
APPROVED_TEXT = "✅ تایید شده"
CANCELLED_TEXT = "🚫  لغو شده"
CHOOSE_USERNAME_ERROR_TEXT = "⚠️ لطفاً برای حساب خود یوزرنیم انتخاب کنید"
SUB_HELP_TEXT = """⭐️ لطفا نام کاربری مورد نظر را بدون @ برای خرید پرمیوم ارسال کنید"""
CHOOSE_OPTION_TEXT = "⭐️ لطفا نوع اشتراک تلگرام پریموم خود را انتخاب کنید"
INVALID_OPTION_TEXT = "❗️ گزینه نامعتبر لطفا دوباره تلاش کنید."
FAILED_UPDATE_STATUS_TEXT = "❗️ وضعیت به‌روزرسانی نشد."
ERROR_SENDING_PHOTO = "❗️ هنگام ارسال عکس برای ادمین خطایی رخ داد."
UNKNOWN_TEXT = "نامشخص"
NO_SUB_TEXT = "🚫 شما اشتراکی ندارید."
USERNAME_LIMITS_TEXT = "⚠️ لطفا یوزر نیم را به درستی وارد کنید. یک یوزر نیم درست شامل : حروف انگلیسی A تا Z ، اعداد 0 تا 9 ، آندرسکور( _ )، و ۵ تا ۳۲ حرف است"
STATUS_UPDATED_TEXT = "وضعیت تغییر کرد به : "
ITS_PAID_TEXT = "✅ مشتری گرامی تراکنش شما تایید شد"
ADMIN_PANEL_TEXT = "👤  ادمین"


def cancelled_username_text(sub_name):
    text = f"""⚠️ مشتری گرامی درخواست '{sub_name}' شما به دلیل اشتباه بودن نام کاربری یا دلیلی دیگر لغو شد اگر فکر میکنید اشتباه شده میتوانید با استفاده از دکمه زیر با ادمین ارتباط بگیری 👇"""

    return text


def cancelled_payment_text(sub_name):
    text = f"""⚠️ مشتری گرامی درخواست '{sub_name}'️ شما به دلیل اشتباه بودن تراکنش لفو شد اگر فکر میکنید اشتباه شده میتوانید با استفاده از دکمه زیر با ادمین ارتباط بگیرید 👇"""

    return text


def approved_payment(sub_name):
    text = f"✅ مشتری گرامی تراکنش شما برای درخواست ' {sub_name}' تایید شد به زودی اشتراک مورد نظر شما برای شما فعال خواهد شد"
    return text


def approved(sub_name):
    text = f"✅ مشتری گرامی  درخواست  {sub_name}' شما تایید شد و تلگرام پریمیوم برای شما فعال شد"
    return text
