from currencyapi import (
    three_month_price_rounded,
    six_month_price_rounded,
    twelve_month_price_rounded,
)

WELCOME_TEXT = "خوش آمدید"
START_TEXT = "start"
BUY_PREMIUM_TEXT = "🛍️ خرید پرمیوم تلگرام"
BUY_FOR_SELF_TEXT = "🙋‍♂️ خرید برای خودم"
BUY_FOR_FRIENDS_TEXT = "🙋‍♂️🙋‍♂️🙋‍♂️ خرید برای دوستان"
BUY_SUCCESS_TEXT = "✅ خرید با موفقیت انجام شد"
LOREM = "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد."
FAQ_TEXT = "❓ سوالات پر تکرار"
MY_PURCHASES_TEXT = "❇️ درخواست های من"
GO_BACK_TEXT = "🔙 بازگشت"
THREE_M_SUB_TEXT = f"{three_month_price_rounded} تلگرام پرمیوم سه ماهه"
SIX_M_SUB_TEXT = f"{six_month_price_rounded} تلگرام پرمیوم شش ماهه"
TWELVE_M_SUB_TEXT = f"{twelve_month_price_rounded} تلگرام پرمیوم دوازده ماهه"
PENDING_APPROVAL_TEXT = "در انتظار تایید"
REVIEWING_TEXT = "در حال بررسی"
APPROVED_TEXT = "تایید شده"
CANCELLED_TEXT = "لغو شده"
CHOOSE_USERNAME_ERROR_TEXT = "لطفاً برای حساب خود یوزرنیم انتخاب کنید"
SUB_HELP_TEXT = "لطفا نام کاربری مورد نظر را بدون @ برای خرید پرمیوم ارسال کنید یا روی دکمه زیر کلیک کنید تا برای نام کاربری شما پرمیوم فعال شود"
CHOOSE_OPTION_TEXT = "یک گزینه را انتخاب کنید"
INVALID_OPTION_TEXT = "گزینه نامعتبر لطفا دوباره تلاش کنید."
FAILED_UPDATE_STATUS_TEXT = "وضعیت به‌روزرسانی نشد."
ERROR_SENDING_PHOTO = "هنگام ارسال عکس برای ادمین خطایی رخ داد."
UNKNOWN_TEXT = "نامشخص"
NO_SUB_TEXT = "شما اشتراکی ندارید."
